Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: སུམ་ཅུ་རྩ་གཉིས་པའི་རིས་ཀྱི་ལྷའི་བུ་མེ་ཏོག་སྣ་ཚོགས་འཐོར་བར་བྱེད་པ་དང་།
en: The devas from the realm of Thirty-Three, hovering in the canopy of the sky, scattered various flowers.

source: གོས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་འཚེར་བར་བྱེད་པ་དང་སུམ་ཅུ་རྩ་གསུམ་པའི་རིས་ཀྱི་ལྷའི་མུ་ཏིག་གི་དོ་ཤལ་དང་། གདུ་བུ་དང་། དཔུང་རྒྱན་དང་།
en: They threw various divine jewels and items of clothing.

source: རྒྱན་ཟླ་གམ་ཅན་དང་། མུ་ཏིག་དམར་པོ་དང་། ཀ་ཤི་ཀའི་གོས་སྣ་ཚོགས་པ་འཐོར་བར་བྱེད་པར་གྱུར་ཏོ། །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་།
en: They threw various divine pearl necklaces, bracelets, armbands, pearl necklaces made of moon-colored pearls and red pearls, and garments made from Vārāṇasī silk.

source: གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། གཞོན་ནུ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། དབང་ཕྱུག་ལ་སོགས་པ་ལྷའི་བུ་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུས་ལྷའི་གཞལ་ཡས་ཁང་རྣམ་པ་སྣ་ཚོགས་པ་དང་།
en: Śakra the chief of the devas from the realm of Thirty-Three, Brahmā, Viṣṇu, Maheśvara, Yama, Varuṇa, Kumāra, the Four Great Kings, and the ninety-nine thousand gods headed by Īśvara threw various tools and implements created by the devas.

source: ལྷའི་གོས་དང་མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་དང་། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱུང་བའི་གདུགས་སྣ་ཚོགས་པ་རྣམས་ནམ་མཁའི་མཐིལ་དུ་ཀུན་ཏུ་གཏོར་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་།
en: They threw divine garments, flowers, fragrances, garlands, scented oils, and various parasols fashioned out of the seven precious jewels.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ཕྱག་ན་རྡོ་རྗེ་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་འཁོར་ལ་མཆོད་པའི་སྤྲིན་ཆེན་པོར་གྱུར་ཏེ་མཆོད་པ་ཆེན་པོ་བྱེད་པར་གྱུར་ཏོ།
en: They threw them from the canopy of the sky, creating a great cloud of offerings for the blessed Śākyamuni, Noble Avalokiteśvara, Vajrapāṇi, and the assembly of the vidyārājas, worshiping them with these generous offerings.

source: །རྫུ་འཕྲུལ་ཆེན་པོའི་ཆོ་འཕྲུལ་ཆེན་པོ་མཐོང་བར་གྱུར་ཏོ། །དངོས་གྲུབ་ཆེན་པོའི་མཚན་མ་བྱུང་བར་གྱུར་པ་རྣམས་ཡང་དག་པར་མཐོང་ངོ་།
en: Great miraculous events and magical feats were witnessed clearly, attesting to the great magical power behind them.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡང་དག་པར་མཐོང་བར་གྱུར་ཏོ།
en: All the tathāgatas with their retinues and assemblies in all the buddha fields in the ten directions became clearly visible.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་རྣམས་ཀུན་ཏུ་ཡང་དག་པར་བྱེའོ། །ལྷའི་གཞལ་ཡས་ཁང་སྣ་ཚོགས་པ་བྱུང་བར་གྱུར་པ་མཐོང་ངོ་།
en: All the secret maṇḍalas of all the tathāgatas were laid open, and various celestial palaces could be clearly seen.

source: །དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་ནས་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་རྡོ་རྗེ་གསོར་བཞིན་དུ།
en: Vajrapāṇi, the great yakṣa general, approached the Blessed One, circumambulated him clockwise three times, saluted him by bowing his head to the Blessed One’s feet, and stood in front of him, waving his vajra scepter.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས་བཞིན་འཛུམ་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས། རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཆེ་ཞིང་ཆེ་བ་ཡང་དག་པར་སྣང་བ་དང་།
en: Smiling, he asked the Blessed One, “I see, O Lord, a great display of miraculous events.

source: མཆོད་པའི་སྤྲིན་གྱི་ཆར་ཆེ་ཞིང་ཆེ་བ་རབ་ཏུ་འབབ་པ་དང་།
en: I see a great rain falling, with great clouds of offerings.

source: བཅོམ་ལྡན་འདས་དངོས་གྲུབ་ཀྱི་མཚན་མ་ཆེ་ཞིང་ཆེ་བ་སྣང་བ་དང་། ལྷ་དང་།
en: I see, O Lord, the signs of great magical power.

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: I see devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other nonhuman and human beings who have gathered in this great assembly.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་འཁོར་ཆེན་པོ་འདུས་པར་གྱུར་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་སྐྱེས་པར་མཐོང་བར་སྣང་བ་དང་།
en: I see the great king of vidyās in plain sight.

source: ཆོ་འཕྲུལ་ཆེ་ཞིང་ཆེ་བ་སྣང་བ་དང་།
en: I see a great display of miraculous events.

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་བ་མཐོང་བ་དང་།
en: I see a display of magical creations.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རིག་སྔགས་ཆེན་པོ་འབྱུང་བར་སྣང་བ་ནི།
en: I see the arising of the great vidyā of Noble Avalokiteśvara, the great bodhisattva being.

source: བཅོམ་ལྡན་འདས་རྒྱུ་ཅི་ལགས། རྐྱེན་ཅི་ལགས།
en: What is the cause of this, O Lord, what is the reason?

source: འདི་ཅིའི་མཐུས་སྔོན་གྱི་མཚན་མ་ཡང་དག་པར་སྣང་བ་ལགས།
en: What does the display seen here portend?

source: འདི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་གང་ཞིག་ཡང་དག་པར་སྣང་བ་ལགས།
en: What are these magical creations that I see?

source: བཅོམ་ལྡན་འདས་བདག་གི་སེམས་ལ་ཐེ་ཙོམ་དེ་སྐྱེས་པར་གྱུར་པས།
en: These questions, Lord, arise in my mind.

source: དེ་ངེས་པར་བསྟན་དུ་གསོལ། ཞུ་བ་ལུང་སྟོན་པར་འགྱུར་བ་གང་གིས། བདག་གི་དོགས་པ་རྣམ་པར་སེལ་བ་དང་།
en: Please explain these points, Lord, so that my uncertainty is dispelled and I know the answers to my questions.

source: སོམ་ཉི་རྣམ་པར་སེལ་བར་བྱེད་པས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་དབྱེ་རུ་གསོལ།
en: Please be so kind, Lord, to clarify this for me!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལག་ན་རྡོ་རྗེ་ངེས་པར་བསྟན་པར་བྱའི་ཉོན་ཅིག །
en: The blessed Tathāgata Śākyamuni gave the following reply to Vajrapāṇi, the great yakṣa general, “Listen Vajrapāṇi! I will now explain these points.

source: ལག་ན་རྡོ་རྗེ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་བའོ།
en: All these displays have been magically created by the illusory appearance samādhi of Noble Avalokiteśvara, the great bodhisattva being present here.

source: །སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་སོགས་པ་ཏིང་ངེ་འཛིན་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུས་རྣམ་པར་འཕྲུལ་པའོ། །ལག་ན་རྡོ་རྗེ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མཐུས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྣང་བར་བྱེད་དོ། །དོན་ཡོད་པ་རྣམ་པར་འཕྲུལ་པ།
en: He produces such miraculous displays, Vajrapāṇi, through magical powers particular to himself that are derived from hundreds of thousands of millions of billions of samādhis, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, such as the vajra-like samādhi, the heroic gait samādhi, and so forth.

source: ཀུན་ཏུ་སྣང་བའི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་། ཆོ་ག་ཞིབ་མོ་དང་། གསང་སྔགས་དང་། གཟུངས་དང་།
en: He amogha-creates miraculous displays, the great maṇḍala of the compassionate gaze, the mudrās, the rites, the mantras, and the dhāraṇīs, all through the kings of vidyās.

source: རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་། རིག་སྔགས་ཀུན་ཏུ་སྣང་བ་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་རྣམ་པར་སྣང་བར་བྱེད་དོ། །དེའི་མཐུས་སྣང་བ་འདི་དང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: He demonstrates the vidyā power of the king of vidyās, and through demonstrating this power these miraculous magical displays are seen. “

source: ཆོ་འཕྲུལ་འདི་སྣང་ངོ་། །ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་མཐོང་བ་དང་། མིང་བཟུང་བ་ཙམ་གྱིས་ཀྱང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ཀྱི་རྡུལ་ཕྲ་རབ་དང་མཉམ་པ་མངོན་སུམ་དུ་མཐོང་བ་དང་། མཚན་གཟུང་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Vajrapāṇi, by merely beholding the king of vidyās, or by recalling its name, the vidyā holder will plant the roots of virtue and accumulate an amount of merit as great as if he directly beheld or recalled the names of hundreds of thousands of millions of billions of tathāgatas, the worthy, fully realized buddhas as numerous as the atoms in the universe or the grains of sand in twenty-two Gaṅgā rivers.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་དང་། རིག་སྔགས་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། སྙིང་པོའི་མཐུ་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ།
en: Attuned to their heart essence, he will activate the samayas of all the tathāgata families and all collections of vidyās, mudrās, and mantras.

source: །དམ་ཚིག་གི་དཀྱིལ་འཁོར་གསང་བར་རབ་ཏུ་ཞུགས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོ་ག་ཞིབ་མོའི་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ། །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ལན་ཅིག་བཟླས་པ་དེ་རྣམས་ཀྱང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དྲུང་དུ། འདས་པ་དང་།
en: He will enter the secret samaya maṇḍala and gain access to the rites of all the tathāgatas. “

source: མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྙིང་པོ་དང་། ཕྱག་རྒྱ་དང་། གསང་བའི་དཀྱིལ་འཁོར་གྱི་དམ་ཚིག་དང་། གསང་སྔགས་ཆེན་པོ་རིམ་པར་ཕྱེ་བའི་སྒྲུབ་པ་ལ་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ།
en: By reciting the king of vidyās just once, the vidyā holder will, in the presence of all the tathāgatas, the blessed buddhas of the three times—past, present, and future—validate his practice of the set of great mantras and the samaya of the seal-maṇḍala that constitutes their heart essence.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ནི། རྫུ་འཕྲུལ་ཆེ་བའི་ཕྱིར་ཏེ། འདི་ལྟ་སྟེ། འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ།
en: Because, Vajrapāṇi, this king of vidyās has great magical power and tremendous efficacy.

source: སྙིང་པོ་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། དཀྱིལ་འཁོར་གསང་བ་ལ་རབ་ཏུ་ཞུགས་ཤིང་དབང་བསྒྱུར་བའི་རྗེས་སུ་ཞུགས་པ་ནི་རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་སྙིང་པོར་གྱུར་པ་གཅིག་པུའོ། །འདི་ལྟ་སྟེ། འོ་མ་དང་ཆུ་ཡང་དག་པར་འབྱུང་བ་བཞིན་ནོ།
en: It allows the vidyā holder, in the presence of all the tathāgatas of the past, present, and future, to enter into the secret maṇḍala and the heart-essence seal and become one in essence with the king of vidyās, just like milk combined with water. “

source: །སྙིང་པོ་གཅིག་པོ་འདི། རིགས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོའི་རྗེས་སུ་ཞུགས་པའོ།
en: This king of vidyās allows the vidyā holder to become one in essence with, and to gain entry to, all the vidyā maṇḍalas, the collections of mudrās, and all the rites.

source: །དེས་ན་ལག་ན་རྡོ་རྗེ་ཁྱོད་ཀྱིས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། ཀུན་ནས་རྗེས་སུ་འཇུག་པ་ཞེས་བྱའོ། །ལག་ན་རྡོ་རྗེ་རྒྱུ་དེས་ན། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ།
en: Because of this, O Vajrapāṇi, this king of vidyās is referred to as the universal entry.

source: དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། མིང་ལན་ཅིག་གཟུང་བ་ཙམ་གྱིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་དྲུང་དུ། གསང་བ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དང་། གཟུངས་དང་། གསང་སྔགས་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་རབ་ཏུ་སྟོན་པ་དང་།
en: Consequently, Vajrapāṇi, if the vidyā holder—regardless of whether they are a son or a daughter of good family, a monk or a nun, or a male or a female lay practitioner—mindfully repeats the name of the king of vidyās just once, they will activate all the dhāraṇīs, mantras, mudrās, and rites of the secret essence in the presence of all the blessed buddhas of the three times. “

source: མཚན་གཟུང་བར་བྱས་པར་འགྱུར་རོ། །དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་དྲུང་དུ། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: When the vidyā holder thus repeats the name of the king of vidyās with full understanding, he will, in the presence of the tathāgatas of the three times, accumulate a great amount of merit and plant roots of great virtue.

source: །དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལེགས་སོ་ཞེས་བྱ་བ་སྩོལ་བར་འགྱུར་རོ། །དོན་ཡོད་པ་ཡངས་པ་ཆེན་པོའི་དངོས་གྲུབ་རབ་ཏུ་སྩོལ་བར་འགྱུར་རོ། །མཆོག་ཏུ་གྲུབ་པ་ཆེན་པོར་འགྱུར་རོ།
en: These tathāgatas, the blessed buddhas of the three times, will applaud him and grant him the vast and great amogha accomplishment, whereby he will become a supreme and accomplished being.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱིའི་རིགས་ཀྱི་དམ་ཚིག་གི་དངོས་གྲུབ་སོ་སོར་རྙེད་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། རིག་སྔགས་ཀྱི་སྙིང་པོ་དང་། ཏིང་ངེ་འཛིན་དང་། རྫུ་འཕྲུལ་གྱི་ཡུལ་དང་།
en: He will accomplish the samayas of all tathāgata families equally and will attain the samādhi called the vidyā essence of magical creations of all the tathāgatas that constitutes a base of magical powers.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་རྒྱན་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་རྗེས་སུ་སོང་བར་འགྱུར་རོ། །རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་རྗེས་སུ་སྦྱོར་ཞིང་དམ་ཚིག་གི་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ།
en: He will be adorned with thoughts worthy of a bodhisattva, attain the six perfections, and develop a close samaya bond with all the deities of the maṇḍala of the king if vidyās. “

source: །ལག་ན་རྡོ་རྗེ་དེ་བཞིན་དུ། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་མཐུ་ཆེན་པོས་རྣམ་པར་འཕྲུལ་པ།
en: In this way, Vajrapāṇi, this king of vidyās possess great might and magical powers.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པའོ།
en: It was blessed by all the tathāgatas and is used by all bodhisattvas for magical purposes.

source: །ལག་ན་རྡོ་རྗེ། དེ་བས་ན། དེ་རྣམས་རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་མཐུ་ཆེན་པོའོ། །ལག་ན་རྡོ་རྗེ། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། མེ་ཏོག་གམ། བདུག་པའམ།
en: This king of vidyās, Vajrapāṇi, is thus extremely powerful.

source: དྲི་དང་བྱུག་པ་དང་། རོལ་མོ་གཅིག་གིས་མཆོད་པ་དང་། ལན་ཅིག་ཙམ་གྱིས་ཀྱང་། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་སྙིང་པོ་གསང་བ་དང་། མཆོད་པ་རྣམས་བྱས་པ་དང་།
en: By offering, Vajrapāṇi, a single flower in worship to the king of vidyās, or a single item of incense, perfume, scented oil, and so forth, even if it is offered just once, the vidyā holder will have worshiped the secret heart essence of all the tathāgatas of the three times.

source: མཉེས་པར་བྱས་པ་དང་། ཀློག་པར་བྱས་པར་འགྱུར་རོ།
en: He will have propitiated and studied it.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་གསང་བའི་དམ་ཚིག་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། གཟུངས་དང་། རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: He will have worshiped the secret samaya maṇḍalas of all the tathāgatas and the totality of all mudrās, mantras, and dhāraṇīs that are used in sovereign rituals. “

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་དྲན་པ་ཙམ་གྱིས། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། བགེགས་དང་། ལོག་པར་འདྲེན་པ་དང་། བདུད་ཀྱི་རིགས་ཀྱི་ལྷ་དེ་རྣམས་ཐམས་ཅད་ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་འབྲོས་པར་བྱེད་དོ། །ཡམས་ཐམས་ཅད་དང་། ཉེ་བར་འཚེ་བ་ཐམས་ཅད་དང་། ནད་འགོ་བ་ཐམས་ཅད་དང་། གདོན་ཐམས་ཅད་དང་།
en: As soon as the vidyā holder remembers this king of vidyās, all yakṣas, rākṣasas, vighnas, vināyakas, and the hosts of Māra will flee in the ten directions.

source: ནད་ཐམས་ཅད་དང་། འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པ་རྣམས་ཐམས་ཅད་དང་། གཏམ་ངན་གྱི་འཇིགས་པ་རྣམས་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: All misfortunes, calamities, and disasters, all epileptic seizures and diseases, all the lies that are told during quarrels, disputes, and disagreements, all dangers and vices, and all opponents and adversaries will be pacified.

source: །གདུག་པ་ཐམས་ཅད་དང་། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་དང་། མི་མཛའ་བ་རྣམས་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་གྲོལ་བར་བྱེད་དོ། །མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ། སྡིག་པ་དང་སྒྲིབ་པ་དང་། ཉོན་མོངས་པ་རྣམས་རྣམ་པར་གྲོལ་བར་བྱེད་དོ།
en: The vidyā holder will be freed from all his evil and obscurations, and he will be completely free from all wrongdoings starting with the five acts of immediate retribution, as well as all obscurations and afflictions.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབུགས་འབྱིན་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་དགོངས་པར་འགྱུར་རོ། །ལྷ་རྣམས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཀུན་ཏུ་སྲུང་བར་འགྱུར་རོ།
en: He will be comforted by all tathāgatas, remembered and cared for by all bodhisattvas, and protected by all deities. “

source: །ལག་ན་རྡོ་རྗེ་རིག་སྔགས་འཆང་གི་དབང་པོ་རྗེས་སུ་འབྲང་བར་འགྱུར་ཞིང་། སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦེད་པར་བྱེད་དོ། །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་བཅུ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: Vajrapāṇi, the lord of the vidyādharas, will stand by as the great yakṣa general with a vajra in hand to guard, protect, and defend him.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་དཔུང་དང་བཅས། འཁོར་དང་བཅས་པས་ཀུན་ནས་ཕྱོགས་བཞིར་སྲུང་བར་བྱེད་དོ།
en: The Four Great Kings with their armies and retinues will protect him throughout the four quarters.

source: །ཐམས་ཅད་དུ་ཆོ་ག་ཞིབ་མོ་དང་། གསང་སྔགས་དང་ཕྱག་རྒྱའི་དངོས་གྲུབ་མཆོག་སྦྱིན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་གི་དངོས་གྲུབ་ཆེན་པོ་སྦྱིན་པར་འགྱུར་རོ།
en: He will be granted the supreme accomplishment of all rites, mantras, and mudrās and the great accomplishment of the samaya of all the tathāgata families.

source: །པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་འདི་དང་། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་གསང་བ་དོན་ཡོད་པའི་དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་ཏུ་འགྱུར་རོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: He will accomplish the great lotus maṇḍala—the maṇḍala of liberation that is the heart essence of Amoghapāśa—and he will realize the secret amogha reality. “

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: All devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and rākṣasas will always stand by the vidyā holder and remain in his thrall.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དྲུང་དུ་མཆོད་པ་ཆེན་པོ་བྱེད་པར་འགྱུར་རོ།
en: He will receive many offerings from all beings and be regarded as worthy of worship.

source: །བཀྲ་ཤིས་དང་ཡིད་ལ་བསམས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །གཤེད་བྱེད་དང་། བྱད་སྟེམས་དང་། གསང་སྔགས་དང་། རོ་ལངས་དང་། སེམས་བསྒྱུར་བ་དང་།
en: All his wishes and auspicious thoughts will come true.

source: སྦོད་གཏོང་གི་སྦྱོར་བ་དང་། མཁའ་འགྲོ་མ་རྣམས་ཐམས་ཅད་འབྱེར་བར་བྱེད་དོ། །དུག་དང་། སྦྱར་དུག་དང་། ཕྱེ་མའི་སྦྱོར་བ་རྣམས་ཐམས་ཅད་འབྱེར་བར་བྱེད་དོ། །རིམས་རྣམས་ཐམས་ཅད་འབྱོར་བར་འགྱུར་རོ། །ཉིན་གཅིག་པ་དང་། ཉིན་གཉིས་པ་དང་།
en: The mantras of all the kṛtyas, kākhordas, vetālas, and ciccas, the magic of the ḍākinīs, and all poisons, venoms, and toxic powder preparations will be neutralized.

source: ཉིན་གསུམ་པ་དང་། ཉིན་བཞི་པ་དང་། མཚན་གཅིག་པ་དང་། ཉིན་གཅིག་པ་དང་། གྲང་བའི་རིམས་དང་། རླུང་ལས་གྱུར་པ་དང་། མཁྲིས་པ་ལས་གྱུར་པ་དང་། བད་ཀན་ལས་གྱུར་པ་དང་། འདུས་པ་ལས་གྱུར་པ་དང་། མགོ་གཟེར་དང་། ཕོལ་མིག་དང་། གཡན་པ་དང་།
en: All spirits that cause fever—fevers that recurs every day, every two days, every three days, or every four days, daytime and nighttime fevers, or cold fevers—will depart. “

source: མིག་ནད་དང་། གཞོགས་ཕྱེད་ན་བ་དང་། མ་རོ་ཙ་ཀ་དང་། མཚན་བར་རྡོལ་བ་དང་། ཕོ་བའི་ནད་དང་། བཤང་བ་འཁྱིལ་བ་དང་། རྣ་བ་ན་བ་དང་། སོ་ན་བ་དང་། རྩིབ་ལོགས་ན་བ་དང་། མཆིན་པ་ན་བ་དང་། ཚད་པ་དང་། གཅིན་ནད་དང་། གསུད་པ་དང་། ལྟོ་བ་ན་བ་དང་། ལག་པ་ན་བ་དང་། རྐང་པ་ན་བ་དང་། ཡན་ལག་ན་བ་དང་། ཉིང་ལག་ན་བ་དེ་དག་ཐམས་ཅད་དྲན་པ་ཙམ་གྱིས་རྣམ་པར་འཇིག་པར་བྱེད་དོ། །ཤ་བཀྲ་དང་། མཛེ་དང་། འབྲས་དང་། ཕོལ་མིག་དང་། ལྷོག་པ་དང་། རྐང་
en: All disorders caused by the imbalance of wind, bile, or phlegm, as well as headaches, boils, scabs, eye diseases, hemiplegia, loss of appetite, fistulas, seizures, constipation, earache, toothache, pain in the flanks, diseases of the spleen, dysentery, urinary diseases, uncontrollable purging, stomachache, pain in the hands, pain in the feet, and pain in any major or minor parts of the body, will disappear as soon as the patient remembers the king of vidyās.

source: ཤུ་དང་། མེ་དབལ་དང་། ཤུ་བ་དང་། འབྲུམ་བུ་ཕྲ་མོ་དང་། རྨ་དང་། མགྲིན་པ་འགགས་པ་དེ་དག་ཐམས་ཅད་བྱབས་པ་ཙམ་གྱིས་རྣམ་པར་འཇིག་པར་བྱེད་དོ། །ཕྱིས་ཀྱང་ནམ་ཡང་ཚུགས་པར་མི་འགྱུར་རོ།
en: Spotted leprosy, boils, ulcers, blisters, festering abscesses, scabs, erysipelas, cutaneous eruptions, lice, wounds, and asthma attacks will all disappear as soon as the patient is scrubbed, never to occur again. “

source: །འདི་དེ་ལྟར་གོ་སྐབས་ཡངས་ལ་རྒྱ་ཆེ་བ་ཡིན་ནོ། །ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པའི་ཆུ་སྐྱེས་ཀྱི་ཞགས་པ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ།
en: This king of vidyās, O Vajrapāṇi, has a very broad range of applications.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་ཞེས་བྱ་བ།
en: It constitutes the heart essence of Amoghapāśa, who has an amogha lotus-noose pure as a lotus.

source: དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབ། རྡོ་རྗེ་གསང་བའི་སྙིང་པོ། དམ་ཚིག་བྱིན་གྱིས་རློབ་པའི་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱའོ།
en: It was blessed by all the tathāgatas of the three times and arises magically through the samaya blessing of their secret vajra essence.”

source: །དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཞུས་པའི་དགེ་མཚན་དང་། བཀྲ་ཤིས་པ་གསང་བ་བྱིན་གྱིས་རློབ་པ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་ཐོས་ནས་ཚིམ་པ་དང་།
en: Vajrapāṇi, the great yakṣa general, heard directly from the Blessed One about the great magical powers of the king of vidyās that auspiciously arise from the secret blessing of the tathāgatas.

source: མགུ་བ་དང་།
en: His curiosity was thus satisfied, and was he was filled with delight.

source: ཡི་རངས་པ་དང་། རབ་ཏུ་དགའ་བ་དང་། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Elated and joyful, and with affection and kindness arising in his heart, he spoke to the Blessed One: “O Blessed One!

source: །བཅོམ་ལྡན་འདས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱི་མཆོག་སྦྱིན་པར་བྱེད་པ་འདི་ནི་ཤིན་ཏུ་དཀོན་ནོ། །བཅོམ་ལྡན་འདས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ།
en: This king of vidyās, which is so difficult to find, auspiciously combines all good qualities.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་དང་།
en: It grants boons, makes the roots of all virtue grow, and helps with the accumulation of all types of merit.

source: གསང་བའི་དཀྱིལ་འཁོར་གྱི་དམ་ཚིག་གི་དངོས་གྲུབ་བླ་ན་མེད་པ་ཐམས་ཅད་ཡང་དག་པར་རྫོགས་པར་བྱེད་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་མཆོག་ཏུ་དཀོན་ཏེ།
en: This great king of vidyās, which is extremely difficult to obtain, grants the supreme accomplishment of the samayas of all secret maṇḍalas.

source: དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པར་བལྟ་བར་བགྱིའོ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དང་།
en: It is regarded as equal to the Tathāgata himself, and it represents the seat of awakening of the tathāgatas.

source: དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་མཉམ་པའོ། །བཅོམ་ལྡན་འདས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ།
en: This king of vidyās, O Blessed One, creates the right circumstances for turning the wheel of Dharma.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དཔྲལ་བའི་བར་ནས་ངེས་པར་བྱུང་བ་ནི། རིག་པ་འཛིན་པ་དེ་དག་ཐམས་ཅད་ལ་ཕན་པའི་དོན་དང་། དངོས་གྲུབ་མཐོང་བའི་དེ་ཁོ་ན་ཉིད་ཀྱི་སྒྲུབ་པ་གྲུབ་པ་ཆེད་དུ་འགྱུར་རོ།
en: It resides in and emerges from the forehead of Noble Avalokiteśvara for the benefit of all vidyā holders, so that they may accomplish their practice and display their accomplishments. “

source: །དགེ་བའི་རྩ་བ་མཆོག་ཏུ་ཉེ་བར་བསགས་པར་འགྱུར་བ་ལས་གཞན་མ་ཡིན་ནོ། །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་དྲན་པ་ཙམ་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དགེ་བའི་རྩ་བའི་ཚོགས་གཞལ་དུ་མེད་པ་དང་། ཚད་མེད་པ་དང་། གྲངས་མེད་པ་ཉེ་བར་བསགས་པར་འགྱུར་གྱི་གཞན་དུ་མ་ཡིན་ནོ།
en: In order to accumulate virtue, there is no need to resort to any boon givers other than the king of vidyās, the mere recollection of which allows the vidyā holder to accumulate an infinite amount of merit and plant innumerable roots of immeasurable virtue.

source: །བཅོམ་ལྡན་འདས་ཉིན་མཚན་དུ་ཡང་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་དྲན་པར་བགྱི་སྐད་ཅིག་ཀྱང་མི་བརྗེད་པར་བགྱིའོ།
en: This king of vidyās, O Blessed One, should always be kept in mind, day and night.

source: །བཅོམ་ལྡན་འདས་ཅི་སྟེ་སླར་ཡང་སྔ་དྲོའམ། ཉིན་མོའམ། མཚན་མོའམ། ཟླ་བའམ། ལོ་རེ་ཡང་རུང་སྟེ།
en: It should not be forgotten for even a moment, let alone for the duration of breakfast, a day, a night, a month, or a year.

source: རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་བརྗེད་ན། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བརྗེད་པར་འགྱུར། ཡོངས་སུ་དོར་བར་འགྱུར། བསོད་ནམས་ཀྱི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་དོར་བར་འགྱུར་རོ།
en: If the vidyā holder were to forget this king of vidyās, O Blessed One, he would forget and forsake all buddhas and bodhisattvas, and his entire accumulation of merit would dissipate.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་དེ་དེ་བཞིན་ནོ།
en: The blessed Tathāgata Śākyamuni replied, “It is indeed so, Vajrapāṇi!

source: །ཇི་ལྟར་ཁྱོད་ཀྱིས་སྨྲས་པ་དེ་དེ་བཞིན་ཏེ།
en: It is exactly as you say.
